In [1]:
import pandas as pd

In [2]:
data = {
    'ProductName' : ['Product A', 'Product B', 'Product C'],
    'ProductPrice' : [22250, 16600, 12500]
       }
df = pd.DataFrame(data)
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [3]:
data = {
    'ProductName' : ['Product A', 'Product B', 'Product C'],
    'ProductPrice' : [22250, 16600, 12500]
       }
df = pd.DataFrame(data, index = ['A', 'B', 'C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [4]:
data = {
    'ProductName' : ['Product A', 'Product B', 'Product C'],
    'ProductPrice' : [22250, 16600, 12500]
       }
product_IDs = ['A', 'B', 'C']
df = pd.DataFrame(data, index = product_IDs)
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [8]:
data = [{'ProductName' : 'Product A', 'ProductPrice' : 22250},
       {'ProductName' : 'Product B', 'ProductPrice' : 16600},
       {'ProductName' : 'Product C', 'ProductPrice' : 12500}]
df = pd.DataFrame(data)

In [9]:
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [10]:
data = [{'ProductName' : 'Product A', 'ProductPrice' : 22250},
       {'ProductName' : 'Product B', 'ProductPrice' : 16600},
       {'ProductName' : 'Product C', 'ProductPrice' : [12500, 100000]}]
df = pd.DataFrame(data)
df

  ProductName     ProductPrice
0   Product A            22250
1   Product B            16600
2   Product C  [12500, 100000]

In [11]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'])
ser_prices = pd.Series([22250, 26600, 12500])

In [12]:
data = {'ProdcutName' : ser_products, 'ProductPrice' : ser_prices}
df = pd.DataFrame(data)
df

  ProdcutName  ProductPrice
0   Product A         22250
1   Product B         26600
2   Product C         12500

In [13]:
ser_products = pd.Series(['Product A', 'Product B', 'Product C'], index = ['A', 'B', 'C'])
ser_prices = pd.Series([22250, 26600, 12500], index = ['A', 'B', 'C'])
data = {'ProdcutName' : ser_products, 'ProductPrice' : ser_prices}
df = pd.DataFrame(data)
df

  ProdcutName  ProductPrice
A   Product A         22250
B   Product B         26600
C   Product C         12500

In [14]:
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [15]:
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500, 5000]]
df = pd.DataFrame(data)
df

           0      1       2
0  Product A  22250     NaN
1  Product B  16600     NaN
2  Product C  12500  5000.0

In [16]:
data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]]
df = pd.DataFrame(data)
df

           0      1
0  Product A  22250
1  Product B  16600
2  Product C  12500

In [17]:
df.columns = ['ProductName', 'ProductPrice']
df

  ProductName  ProductPrice
0   Product A         22250
1   Product B         16600
2   Product C         12500

In [18]:
df.index = ['A', 'B', 'C']
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [19]:
df = pd.DataFrame(data = [['Product A', 22250], ['Product B', 16600], ['Product C', 12500]],
                 columns = ['ProductName', 'ProductPrice'],
                 index = ['A', 'B', 'C'])
df

  ProductName  ProductPrice
A   Product A         22250
B   Product B         16600
C   Product C         12500

In [20]:
df.shape

(3, 2)